# Даны координаты центров двух окружностей (x1; y1) (x2; y2) и и их радиусы  R1 и R2.
# Находится ли одна окружность целиком внутри другой
def is_in_circle (x1, y1, r1, x2, y2, r2):
    return (r2-r1)**2 > (x2-x1)**2 + (y2-y1)**2

x1 = 9
y1 = 9
r1= 7
x2 = 12
y2 = 7
r2 = 7

print(is_in_circle(x1, y1, r1, x2, y2, r2))
