## "Дружественные числа"

### Задание

Два натуральных числа называются дружественными, если каждое из них равно сумме всех натуральных делителей другого
(само число при этом не рассматривается в качестве собственного делителя). \
Необходимо найти все пары натуральных дружественных чисел (не равных друг другу), до введенного числа.

### Формат входных данных

Дано одно целое положительное число

### Формат выходных данных

Вывести все пары дружественных чисел, удовлетворяющие условию задачи.

### Решение задачи

m = int(input('m: '))

n = 1
while n < m:
    i = 1
    n_div_sum = 0
    while i < n:
        if n % i == 0:
            n_div_sum += i
        i += 1

    j = 1
    n_div_sum_div_sum = 0
    while j < n_div_sum:
        if n_div_sum % j == 0:
            n_div_sum_div_sum += j
        j += 1
    if n != n_div_sum and n == n_div_sum_div_sum and n_div_sum <= m and n <= n_div_sum:
        print(n, n_div_sum)
    n += 1


---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|  300  | 220 284 |
