## "Бесконечный ввод и подсчет положительных"

### Задание

С клавиатуры вводятся целые числа, до тех пор пока не будет введена строка "стоп". \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Вводятся целые числа, пока не будет введено "стоп".

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

```python
# TODO: you code here...
```
needed_value = "5"
input_value = ""

summ_pos = 0
while needed_value != input_value:
    input_value = input()
    summ_pos += int(input_value)
print(summ_pos-int(needed_value))
---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Выполнение цикла пока не будет введено нужное значение"
</details>
