# "Негостеприимные панды"
# В панда парке был очень плохой управляющий. Из-за его ошибок вышло так, что многие клетки с пандами переполнены,
# многие не заполнены, а есть и вовсе пустые. Пришел новый управляющий и захотел решить создавшуюся проблему,
# перераспределив панд по клеткам.

# Но управляющий столкнулся с двумя проблемами:
# Общество защиты животных запретило выселять панд из клеток, если клетка не переполнена;
# Панды оказались не очень-то дружелюбны к новым соседям и больше одного нового соседа не принимают.
# Зато в пустые клетки можно переселять панд из разных клеток.

# Напишите программу, которая определяет сколько панд были "лишними" в своих клетках (суммарное переполнение клеток).
# И какое суммарное переполнение получится, после массового переселения панд.

# Алгоритм переселения нужно разработать самостоятельно с учетом ограничений.

# Формат входных данных
# n - суммарное количество клеток (4 ≤ n ≤ 100)
# Pn - количество панд в каждой клетке (0 ≤ Pn ≤ 10)
# Sn - количество мест в каждой клетке (1 ≤ Sn ≤10)
